       FD  ARQUIVO-CLIENTE.
       01  REGISTRO-CLIENTE.
           05 NOME   PIC X(20).
           05 IDADE  PIC 9(3).
           05 EMAIL  PIC X(20).
           05 CHAVE  PIC 9(2).
           