       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       AUTHOR. YuriGPS.
      *    Programa para estudo da estrutura básica do Cobol
      *    Objetivo: Exibir "Hello world".
       PROCEDURE DIVISION.
           DISPLAY "Hello World"
           STOP RUN.
