       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       AUTHOR. YuriGPS.
      *    Programa para estudo da estrutura básica do Cobol
      *    Objetivo: Exibir "Hello world" e uma mensagem de texto num arquivo com extensão .cbl
       PROCEDURE DIVISION.
           DISPLAY "Hello World"
           DISPLAY "Yuri linda!"
           STOP RUN.
