       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       PROCEDURE DIVISION.
           DISPLAY "Hello World"
           DISPLAY "Yuri linda!"
           STOP RUN.
