       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog1.
       AUTHOR. YuriGPS.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.

       PROCEDURE DIVISION.
           
      *exemplo de comentário.     
                                              
           DISPLAY "Ihanin Viado! :)".
           DISPLAY 12,56.
           
           
           STOP RUN.
